rails/app/controllers/questions_controller.rb

  def create
    @question = Question.new question_params
    if @question.answer.empty? || @question.question.empty?
      redirect_to :back, notice: 'Input was not saved because question and/or answer were/was empty.'
    elsif @question.save
---
SELECT  1 AS one FROM "questions"  WHERE "questions"."question" = 'What are you doing?' LIMIT 1
INSERT INTO "questions" ("answer", "created_at", "question", "updated_at") VALUES (?, ?, ?, ?)  [["answer", "coding"], ["created_at", "2016-04-16 17:47:43.143625"], ["question", "Favorite past time?"], ["updated_at", "2016-04-16 17:47:43.143625"]]

  def update
    if @question.update_attributes question_params
---
UPDATE "questions" SET "question" = ?, "updated_at" = ? WHERE "questions"."id" = 1  [["question", "Favorite language?"], ["updated_at", "2016-04-16 18:19:07.593416"]]

    def find_question
      @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]